espressif/esp-idf/components/soc/esp32p4/include/soc/hp_apm_reg.h
/**
 * SPDX-FileCopyrightText: 2022-2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** HP_APM_REGION_FILTER_EN_REG register
 *  Region filter enable register
 */
#define HP_APM_REGION_FILTER_EN_REG (DR_REG_HP_APM_BASE + 0x0)
/** HP_APM_REGION_FILTER_EN : R/W; bitpos: [15:0]; default: 1;
 *  Region filter enable
 */
#define HP_APM_REGION_FILTER_EN    0x0000FFFFU
#define HP_APM_REGION_FILTER_EN_M  (HP_APM_REGION_FILTER_EN_V << HP_APM_REGION_FILTER_EN_S)
#define HP_APM_REGION_FILTER_EN_V  0x0000FFFFU
#define HP_APM_REGION_FILTER_EN_S  0

/** HP_APM_REGION0_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION0_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x4)
/** HP_APM_REGION0_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region0
 */
#define HP_APM_REGION0_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_START_M  (HP_APM_REGION0_ADDR_START_V << HP_APM_REGION0_ADDR_START_S)
#define HP_APM_REGION0_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_START_S  0

/** HP_APM_REGION0_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION0_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x8)
/** HP_APM_REGION0_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region0
 */
#define HP_APM_REGION0_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_END_M  (HP_APM_REGION0_ADDR_END_V << HP_APM_REGION0_ADDR_END_S)
#define HP_APM_REGION0_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION0_ADDR_END_S  0

/** HP_APM_REGION0_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION0_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0xc)
/** HP_APM_REGION0_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION0_R0_PMS_X    (BIT(0))
#define HP_APM_REGION0_R0_PMS_X_M  (HP_APM_REGION0_R0_PMS_X_V << HP_APM_REGION0_R0_PMS_X_S)
#define HP_APM_REGION0_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION0_R0_PMS_X_S  0
/** HP_APM_REGION0_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION0_R0_PMS_W    (BIT(1))
#define HP_APM_REGION0_R0_PMS_W_M  (HP_APM_REGION0_R0_PMS_W_V << HP_APM_REGION0_R0_PMS_W_S)
#define HP_APM_REGION0_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION0_R0_PMS_W_S  1
/** HP_APM_REGION0_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION0_R0_PMS_R    (BIT(2))
#define HP_APM_REGION0_R0_PMS_R_M  (HP_APM_REGION0_R0_PMS_R_V << HP_APM_REGION0_R0_PMS_R_S)
#define HP_APM_REGION0_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION0_R0_PMS_R_S  2
/** HP_APM_REGION0_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION0_R1_PMS_X    (BIT(4))
#define HP_APM_REGION0_R1_PMS_X_M  (HP_APM_REGION0_R1_PMS_X_V << HP_APM_REGION0_R1_PMS_X_S)
#define HP_APM_REGION0_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION0_R1_PMS_X_S  4
/** HP_APM_REGION0_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION0_R1_PMS_W    (BIT(5))
#define HP_APM_REGION0_R1_PMS_W_M  (HP_APM_REGION0_R1_PMS_W_V << HP_APM_REGION0_R1_PMS_W_S)
#define HP_APM_REGION0_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION0_R1_PMS_W_S  5
/** HP_APM_REGION0_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION0_R1_PMS_R    (BIT(6))
#define HP_APM_REGION0_R1_PMS_R_M  (HP_APM_REGION0_R1_PMS_R_V << HP_APM_REGION0_R1_PMS_R_S)
#define HP_APM_REGION0_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION0_R1_PMS_R_S  6
/** HP_APM_REGION0_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION0_R2_PMS_X    (BIT(8))
#define HP_APM_REGION0_R2_PMS_X_M  (HP_APM_REGION0_R2_PMS_X_V << HP_APM_REGION0_R2_PMS_X_S)
#define HP_APM_REGION0_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION0_R2_PMS_X_S  8
/** HP_APM_REGION0_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION0_R2_PMS_W    (BIT(9))
#define HP_APM_REGION0_R2_PMS_W_M  (HP_APM_REGION0_R2_PMS_W_V << HP_APM_REGION0_R2_PMS_W_S)
#define HP_APM_REGION0_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION0_R2_PMS_W_S  9
/** HP_APM_REGION0_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION0_R2_PMS_R    (BIT(10))
#define HP_APM_REGION0_R2_PMS_R_M  (HP_APM_REGION0_R2_PMS_R_V << HP_APM_REGION0_R2_PMS_R_S)
#define HP_APM_REGION0_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION0_R2_PMS_R_S  10

/** HP_APM_REGION1_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION1_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x10)
/** HP_APM_REGION1_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region1
 */
#define HP_APM_REGION1_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_START_M  (HP_APM_REGION1_ADDR_START_V << HP_APM_REGION1_ADDR_START_S)
#define HP_APM_REGION1_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_START_S  0

/** HP_APM_REGION1_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION1_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x14)
/** HP_APM_REGION1_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region1
 */
#define HP_APM_REGION1_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_END_M  (HP_APM_REGION1_ADDR_END_V << HP_APM_REGION1_ADDR_END_S)
#define HP_APM_REGION1_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION1_ADDR_END_S  0

/** HP_APM_REGION1_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION1_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x18)
/** HP_APM_REGION1_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION1_R0_PMS_X    (BIT(0))
#define HP_APM_REGION1_R0_PMS_X_M  (HP_APM_REGION1_R0_PMS_X_V << HP_APM_REGION1_R0_PMS_X_S)
#define HP_APM_REGION1_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION1_R0_PMS_X_S  0
/** HP_APM_REGION1_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION1_R0_PMS_W    (BIT(1))
#define HP_APM_REGION1_R0_PMS_W_M  (HP_APM_REGION1_R0_PMS_W_V << HP_APM_REGION1_R0_PMS_W_S)
#define HP_APM_REGION1_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION1_R0_PMS_W_S  1
/** HP_APM_REGION1_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION1_R0_PMS_R    (BIT(2))
#define HP_APM_REGION1_R0_PMS_R_M  (HP_APM_REGION1_R0_PMS_R_V << HP_APM_REGION1_R0_PMS_R_S)
#define HP_APM_REGION1_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION1_R0_PMS_R_S  2
/** HP_APM_REGION1_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION1_R1_PMS_X    (BIT(4))
#define HP_APM_REGION1_R1_PMS_X_M  (HP_APM_REGION1_R1_PMS_X_V << HP_APM_REGION1_R1_PMS_X_S)
#define HP_APM_REGION1_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION1_R1_PMS_X_S  4
/** HP_APM_REGION1_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION1_R1_PMS_W    (BIT(5))
#define HP_APM_REGION1_R1_PMS_W_M  (HP_APM_REGION1_R1_PMS_W_V << HP_APM_REGION1_R1_PMS_W_S)
#define HP_APM_REGION1_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION1_R1_PMS_W_S  5
/** HP_APM_REGION1_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION1_R1_PMS_R    (BIT(6))
#define HP_APM_REGION1_R1_PMS_R_M  (HP_APM_REGION1_R1_PMS_R_V << HP_APM_REGION1_R1_PMS_R_S)
#define HP_APM_REGION1_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION1_R1_PMS_R_S  6
/** HP_APM_REGION1_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION1_R2_PMS_X    (BIT(8))
#define HP_APM_REGION1_R2_PMS_X_M  (HP_APM_REGION1_R2_PMS_X_V << HP_APM_REGION1_R2_PMS_X_S)
#define HP_APM_REGION1_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION1_R2_PMS_X_S  8
/** HP_APM_REGION1_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION1_R2_PMS_W    (BIT(9))
#define HP_APM_REGION1_R2_PMS_W_M  (HP_APM_REGION1_R2_PMS_W_V << HP_APM_REGION1_R2_PMS_W_S)
#define HP_APM_REGION1_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION1_R2_PMS_W_S  9
/** HP_APM_REGION1_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION1_R2_PMS_R    (BIT(10))
#define HP_APM_REGION1_R2_PMS_R_M  (HP_APM_REGION1_R2_PMS_R_V << HP_APM_REGION1_R2_PMS_R_S)
#define HP_APM_REGION1_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION1_R2_PMS_R_S  10

/** HP_APM_REGION2_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION2_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x1c)
/** HP_APM_REGION2_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region2
 */
#define HP_APM_REGION2_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION2_ADDR_START_M  (HP_APM_REGION2_ADDR_START_V << HP_APM_REGION2_ADDR_START_S)
#define HP_APM_REGION2_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION2_ADDR_START_S  0

