espressif/esp-idf/components/soc/esp32p4/include/soc/hp_apm_reg.h
/** HP_APM_REGION4_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION4_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x34)
/** HP_APM_REGION4_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region4
 */
#define HP_APM_REGION4_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION4_ADDR_START_M  (HP_APM_REGION4_ADDR_START_V << HP_APM_REGION4_ADDR_START_S)
#define HP_APM_REGION4_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION4_ADDR_START_S  0

/** HP_APM_REGION4_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION4_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x38)
/** HP_APM_REGION4_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region4
 */
#define HP_APM_REGION4_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION4_ADDR_END_M  (HP_APM_REGION4_ADDR_END_V << HP_APM_REGION4_ADDR_END_S)
#define HP_APM_REGION4_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION4_ADDR_END_S  0

/** HP_APM_REGION4_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION4_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x3c)
/** HP_APM_REGION4_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION4_R0_PMS_X    (BIT(0))
#define HP_APM_REGION4_R0_PMS_X_M  (HP_APM_REGION4_R0_PMS_X_V << HP_APM_REGION4_R0_PMS_X_S)
#define HP_APM_REGION4_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION4_R0_PMS_X_S  0
/** HP_APM_REGION4_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION4_R0_PMS_W    (BIT(1))
#define HP_APM_REGION4_R0_PMS_W_M  (HP_APM_REGION4_R0_PMS_W_V << HP_APM_REGION4_R0_PMS_W_S)
#define HP_APM_REGION4_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION4_R0_PMS_W_S  1
/** HP_APM_REGION4_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION4_R0_PMS_R    (BIT(2))
#define HP_APM_REGION4_R0_PMS_R_M  (HP_APM_REGION4_R0_PMS_R_V << HP_APM_REGION4_R0_PMS_R_S)
#define HP_APM_REGION4_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION4_R0_PMS_R_S  2
/** HP_APM_REGION4_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION4_R1_PMS_X    (BIT(4))
#define HP_APM_REGION4_R1_PMS_X_M  (HP_APM_REGION4_R1_PMS_X_V << HP_APM_REGION4_R1_PMS_X_S)
#define HP_APM_REGION4_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION4_R1_PMS_X_S  4
/** HP_APM_REGION4_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION4_R1_PMS_W    (BIT(5))
#define HP_APM_REGION4_R1_PMS_W_M  (HP_APM_REGION4_R1_PMS_W_V << HP_APM_REGION4_R1_PMS_W_S)
#define HP_APM_REGION4_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION4_R1_PMS_W_S  5
/** HP_APM_REGION4_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION4_R1_PMS_R    (BIT(6))
#define HP_APM_REGION4_R1_PMS_R_M  (HP_APM_REGION4_R1_PMS_R_V << HP_APM_REGION4_R1_PMS_R_S)
#define HP_APM_REGION4_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION4_R1_PMS_R_S  6
/** HP_APM_REGION4_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION4_R2_PMS_X    (BIT(8))
#define HP_APM_REGION4_R2_PMS_X_M  (HP_APM_REGION4_R2_PMS_X_V << HP_APM_REGION4_R2_PMS_X_S)
#define HP_APM_REGION4_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION4_R2_PMS_X_S  8
/** HP_APM_REGION4_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION4_R2_PMS_W    (BIT(9))
#define HP_APM_REGION4_R2_PMS_W_M  (HP_APM_REGION4_R2_PMS_W_V << HP_APM_REGION4_R2_PMS_W_S)
#define HP_APM_REGION4_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION4_R2_PMS_W_S  9
/** HP_APM_REGION4_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION4_R2_PMS_R    (BIT(10))
#define HP_APM_REGION4_R2_PMS_R_M  (HP_APM_REGION4_R2_PMS_R_V << HP_APM_REGION4_R2_PMS_R_S)
#define HP_APM_REGION4_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION4_R2_PMS_R_S  10

/** HP_APM_REGION5_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION5_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x40)
/** HP_APM_REGION5_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region5
 */
#define HP_APM_REGION5_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION5_ADDR_START_M  (HP_APM_REGION5_ADDR_START_V << HP_APM_REGION5_ADDR_START_S)
#define HP_APM_REGION5_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION5_ADDR_START_S  0

/** HP_APM_REGION5_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION5_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x44)
/** HP_APM_REGION5_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region5
 */
#define HP_APM_REGION5_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION5_ADDR_END_M  (HP_APM_REGION5_ADDR_END_V << HP_APM_REGION5_ADDR_END_S)
#define HP_APM_REGION5_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION5_ADDR_END_S  0

/** HP_APM_REGION5_PMS_ATTR_REG register
 *  Region access authority attribute register
 */
#define HP_APM_REGION5_PMS_ATTR_REG (DR_REG_HP_APM_BASE + 0x48)
/** HP_APM_REGION5_R0_PMS_X : R/W; bitpos: [0]; default: 0;
 *  Region execute authority in REE_MODE0
 */
#define HP_APM_REGION5_R0_PMS_X    (BIT(0))
#define HP_APM_REGION5_R0_PMS_X_M  (HP_APM_REGION5_R0_PMS_X_V << HP_APM_REGION5_R0_PMS_X_S)
#define HP_APM_REGION5_R0_PMS_X_V  0x00000001U
#define HP_APM_REGION5_R0_PMS_X_S  0
/** HP_APM_REGION5_R0_PMS_W : R/W; bitpos: [1]; default: 0;
 *  Region write authority in REE_MODE0
 */
#define HP_APM_REGION5_R0_PMS_W    (BIT(1))
#define HP_APM_REGION5_R0_PMS_W_M  (HP_APM_REGION5_R0_PMS_W_V << HP_APM_REGION5_R0_PMS_W_S)
#define HP_APM_REGION5_R0_PMS_W_V  0x00000001U
#define HP_APM_REGION5_R0_PMS_W_S  1
/** HP_APM_REGION5_R0_PMS_R : R/W; bitpos: [2]; default: 0;
 *  Region read authority in REE_MODE0
 */
#define HP_APM_REGION5_R0_PMS_R    (BIT(2))
#define HP_APM_REGION5_R0_PMS_R_M  (HP_APM_REGION5_R0_PMS_R_V << HP_APM_REGION5_R0_PMS_R_S)
#define HP_APM_REGION5_R0_PMS_R_V  0x00000001U
#define HP_APM_REGION5_R0_PMS_R_S  2
/** HP_APM_REGION5_R1_PMS_X : R/W; bitpos: [4]; default: 0;
 *  Region execute authority in REE_MODE1
 */
#define HP_APM_REGION5_R1_PMS_X    (BIT(4))
#define HP_APM_REGION5_R1_PMS_X_M  (HP_APM_REGION5_R1_PMS_X_V << HP_APM_REGION5_R1_PMS_X_S)
#define HP_APM_REGION5_R1_PMS_X_V  0x00000001U
#define HP_APM_REGION5_R1_PMS_X_S  4
/** HP_APM_REGION5_R1_PMS_W : R/W; bitpos: [5]; default: 0;
 *  Region write authority in REE_MODE1
 */
#define HP_APM_REGION5_R1_PMS_W    (BIT(5))
#define HP_APM_REGION5_R1_PMS_W_M  (HP_APM_REGION5_R1_PMS_W_V << HP_APM_REGION5_R1_PMS_W_S)
#define HP_APM_REGION5_R1_PMS_W_V  0x00000001U
#define HP_APM_REGION5_R1_PMS_W_S  5
/** HP_APM_REGION5_R1_PMS_R : R/W; bitpos: [6]; default: 0;
 *  Region read authority in REE_MODE1
 */
#define HP_APM_REGION5_R1_PMS_R    (BIT(6))
#define HP_APM_REGION5_R1_PMS_R_M  (HP_APM_REGION5_R1_PMS_R_V << HP_APM_REGION5_R1_PMS_R_S)
#define HP_APM_REGION5_R1_PMS_R_V  0x00000001U
#define HP_APM_REGION5_R1_PMS_R_S  6
/** HP_APM_REGION5_R2_PMS_X : R/W; bitpos: [8]; default: 0;
 *  Region execute authority in REE_MODE2
 */
#define HP_APM_REGION5_R2_PMS_X    (BIT(8))
#define HP_APM_REGION5_R2_PMS_X_M  (HP_APM_REGION5_R2_PMS_X_V << HP_APM_REGION5_R2_PMS_X_S)
#define HP_APM_REGION5_R2_PMS_X_V  0x00000001U
#define HP_APM_REGION5_R2_PMS_X_S  8
/** HP_APM_REGION5_R2_PMS_W : R/W; bitpos: [9]; default: 0;
 *  Region write authority in REE_MODE2
 */
#define HP_APM_REGION5_R2_PMS_W    (BIT(9))
#define HP_APM_REGION5_R2_PMS_W_M  (HP_APM_REGION5_R2_PMS_W_V << HP_APM_REGION5_R2_PMS_W_S)
#define HP_APM_REGION5_R2_PMS_W_V  0x00000001U
#define HP_APM_REGION5_R2_PMS_W_S  9
/** HP_APM_REGION5_R2_PMS_R : R/W; bitpos: [10]; default: 0;
 *  Region read authority in REE_MODE2
 */
#define HP_APM_REGION5_R2_PMS_R    (BIT(10))
#define HP_APM_REGION5_R2_PMS_R_M  (HP_APM_REGION5_R2_PMS_R_V << HP_APM_REGION5_R2_PMS_R_S)
#define HP_APM_REGION5_R2_PMS_R_V  0x00000001U
#define HP_APM_REGION5_R2_PMS_R_S  10

/** HP_APM_REGION6_ADDR_START_REG register
 *  Region address register
 */
#define HP_APM_REGION6_ADDR_START_REG (DR_REG_HP_APM_BASE + 0x4c)
/** HP_APM_REGION6_ADDR_START : R/W; bitpos: [31:0]; default: 0;
 *  Start address of region6
 */
#define HP_APM_REGION6_ADDR_START    0xFFFFFFFFU
#define HP_APM_REGION6_ADDR_START_M  (HP_APM_REGION6_ADDR_START_V << HP_APM_REGION6_ADDR_START_S)
#define HP_APM_REGION6_ADDR_START_V  0xFFFFFFFFU
#define HP_APM_REGION6_ADDR_START_S  0

/** HP_APM_REGION6_ADDR_END_REG register
 *  Region address register
 */
#define HP_APM_REGION6_ADDR_END_REG (DR_REG_HP_APM_BASE + 0x50)
/** HP_APM_REGION6_ADDR_END : R/W; bitpos: [31:0]; default: 4294967295;
 *  End address of region6
 */
#define HP_APM_REGION6_ADDR_END    0xFFFFFFFFU
#define HP_APM_REGION6_ADDR_END_M  (HP_APM_REGION6_ADDR_END_V << HP_APM_REGION6_ADDR_END_S)
#define HP_APM_REGION6_ADDR_END_V  0xFFFFFFFFU
#define HP_APM_REGION6_ADDR_END_S  0

